time_input = input("Пожалуйста введите время в формате чч:мм \n")

if time_input.count(":") != 1:
    print("Неверный формат времени. Пожалуйста, введите время в формате чч:мм")
    hours = None
    minutes = None
else:
    hours, minutes = time_input.split(":")
    if not hours.isdigit() or not minutes.isdigit():
        print("Часы и минуты должны быть числами")
        hours = None
        minutes = None
    else:
        hours = int(hours)
        minutes = int(minutes)
        if not (0 <= hours <= 23 and 0 <= minutes <= 59):
            print("Часы должны быть в диапазоне от 0 до 23, а минуты - от 0 до 59")
            hours = None
            minutes = None
        else:
            print("Время успешно введено и проверено")

hours1_dict = {
    "01": "Один час",
    "02": "Два часа",
    "03": "Три часа",
    "04": "Четыре часа",
    "05": "Пять часов",
    "06": "Шесть часов",
    "07": "Семь часов",
    "08": "Восьмь часов",
    "09": "Девять часов",
    "10": "Десять часов",
    "11": "Одиннадцать часов",
    "12": "Двенадцать часов",
    "13": "Один час",
    "14": "Два часа",
    "15": "Три часа",
    "16": "Четыре часа",
    "17": "Пять часов",
    "18": "Шесть часов",
    "19": "Семь часов",
    "20": "Восьмь часов",
    "21": "Девять часов",
    "22": "Десять часов",
    "23": "Одиннадцать часов",
    "24": "Двенадцать часов",
}
hours2_dict = {
    "01": "первого",
    "02": "второго",
    "03": "третьего",
    "04": "четвертого",
    "05": "пятого",
    "06": "шестого",
    "07": "седьмого",
    "08": "восьмого",
    "09": "девятого",
    "10": "десятого",
    "11": "одиннадцатого",
    "12": "двенадцатого",
    "13": "первого",
    "14": "второго",
    "15": "третьего",
    "16": "четвертого",
    "17": "пятого",
    "18": "шестого",
    "19": "седьмого",
    "20": "восьмого",
    "21": "девятого",
    "22": "десятого",
    "23": "одиннадцатого",
    "24": "двенадцатого",
}
hours3_dict = {
    "01": "час",
    "02": "два",
    "03": "три",
    "04": "четыре",
    "05": "пять",
    "06": "шесть",
    "07": "семь",
    "08": "восемь",
    "09": "девять",
    "10": "десять",
    "11": "одиннадцать",
    "12": "двенадцать",
    "13": "час",
    "14": "два",
    "15": "три",
    "16": "четыре",
    "17": "пять",
    "18": "шесть",
    "19": "семь",
    "20": "восемь",
    "21": "девять",
    "22": "десять",
    "23": "одиннадцать",
    "24": "двенадцать",
}
minutes1_dict = {
    "01": "Одна минута",
    "02": "Две минуты",
    "03": "Три минуты",
    "04": "Четыре минуты",
    "05": "Пять минут",
    "06": "Шесть минут",
    "07": "Семь минут",
    "08": "Восемь минут",
    "09": "Девять минут",
    "10": "Десять минут",
    "11": "Одиннадцать минут",
    "12": "Двенадцать минут",
    "13": "Тринадцать минут",
    "14": "Четырнадцать минут",
    "15": "Пятнадцать минут",
    "16": "Шестнадцать минут",
    "17": "Семнадцать минут",
    "18": "Восемнадцать минут",
    "19": "Девятнадцать минут",
    "20": "Двадцать минут",
    "21": "Двадцать одна минута",
    "22": "Двадцать две минуты",
    "23": "Двадцать три минуты",
    "24": "Двадцать четыре минуты",
    "25": "Двадцать пять минут",
    "26": "Двадцать шесть минут",
    "27": "Двадцать семь минут",
    "28": "Двадцать восемь минут",
    "29": "Двадцать девять минут",
    "30": "Половина",
    "31": "Тридцать одна минута",
    "32": "Тридцать две минуты",
    "33": "Тридцать три минуты",
    "34": "Тридцать четыре минуты",
    "35": "Тридцать пять минут",
    "36": "Тридцать шесть минут",
    "37": "Тридцать семь минут",
    "38": "Тридцать восемь минут",
    "39": "Тридцать девять минут",
    "40": "Сорок минут",
    "41": "Сорок одна минута",
    "42": "Сорок две минуты",
    "43": "Сорок три минуты",
    "44": "Сорок четыре минуты",
}
minutes2_dict = {
    "01": "одной минуты",
    "02": "двух минут",
    "03": "трех минут",
    "04": "четырех минут",
    "05": "пяти минут",
    "06": "шести минут",
    "07": "семи минут",
    "08": "восьми минут",
    "09": "девяти минут",
    "10": "десяти минут",
    "11": "одиннадцати минут",
    "12": "двенадцати минут",
    "13": "тринадцати минут",
    "14": "четырнадцати минут",
    "15": "пятнадцати минут",
}
if hours is not None and minutes is not None:
    if minutes == 0:
        print(f"{hours1_dict[str(hours).zfill(2)]} ровно")
    elif minutes < 30:
        print(
            f"{minutes1_dict[str(minutes).zfill(2)]} {hours2_dict[str(hours + 1).zfill(2)]}"
        )
    elif minutes == 30:
        print(f"Половина {hours2_dict[str(hours + 1).zfill(2)]}")
    elif minutes > 30 and minutes < 45:
        print(
            f"{minutes1_dict[str(minutes).zfill(2)]} {hours2_dict[str(hours + 1).zfill(2)]}"
        )
    elif minutes >= 45:
        print(
            f"Без {minutes2_dict[str((60 - minutes) % 60).zfill(2)]} {hours3_dict[str(hours + 1).zfill(2)]}"
        )
