time_str = input("Enter the time in format hh:mm: ")

if time_str.count(':') != 1 or time_str[2] != ':' or len(time_str) != 5:
    print("The time format is incorrect. Enter the time in the hh:mm format.")
else:
    hours, minutes = time_str.split(':')
    
    if not hours.isdigit() or not minutes.isdigit():
        print("ours and minutes should be numbers.")
    else:
        hours = int(hours)
        minutes = int(minutes)
        
        if not (0 <= hours <= 23 and 0 <= minutes <= 59):
            print("ЧThe hours should be in the range from 0 to 23, and the minutes from 0 to 59.")
        else:
            minutes_dict = {
                1: "одна минута",
                2: "две минуты",
                3: "три минуты",
                4: "четыре минуты",
                5: "пять минут",
                6: "шесть минут",
                7: "семь минут",
                8: "восемь минут",
                9: "девять минут",
                10: "десять минут",
                11: "одиннадцать минут",
                12: "двенадцать минут",
                13: "тринадцать минут",
                14: "четырнадцать минут",
                15: "пятнадцать минут",
                16: "шестнадцать минут",
                17: "семнадцать минут",
                18: "восемнадцать минут",
                19: "девятнадцать минут",
                20: "двадцать минут",
                21: "двадцать одна минута",
                22: "двадцать две минуты",
                23: "двадцать три минуты",
                24: "двадцать четыре минуты",
                25: "двадцать пять минут",
                26: "двадцать шесть минут",
                27: "двадцать семь минут",
                28: "двадцать восемь минут",
                29: "двадцать девять минут",
                30: "тридцать минут",
                31: "тридцать одна минута",
                32: "тридцать две минуты",
                33: "тридцать три минуты",
                34: "тридцать четыре минуты",
                35: "тридцать пять минут",
                36: "тридцать шесть минут",
                37: "тридцать семь минут",
                38: "тридцать восемь минут",
                39: "тридцать девять минут",
                40: "сорок минут",
                41: "сорок одна минута",
                42: "сорок две минуты",
                43: "сорок три минуты",
                44: "сорок четыре минуты",
                45: "пятнадцати минут",
                46: "четырнадцати минут",
                47: "тринадцати минут",
                48: "двенадцати минут",
                49: "одиннадцати минут",
                50: "десяти минут",
                51: "девяти минут",
                52: "восьми минут",
                53: "семи минут",
                54: "шести минут",
                55: "пяти минут",
                56: "четырёх минут",
                57: "трёх минут",
                58: "двух минут",
                59: "одной минуты"
            }
            
            hours_dict1 = {
                0: "двенадцатого", 
                1: "первого", 
                2: "второго", 
                3: "третьего", 
                4: "четвертого", 
                5: "пятого", 
                6: "шестого", 
                7: "седьмого", 
                8: "восьмого", 
                9: "девятого", 
                10: "десятого", 
                11: "одиннадцатого", 
            }
            
            hours_dict2 = {
                0: "двенадцать", 
                1: "один", 
                2: "два", 
                3: "три", 
                4: "четыре", 
                5: "пять", 
                6: "шесть", 
                7: "семь", 
                8: "восемь", 
                9: "девять", 
                10: "десять", 
                11: "одиннадцать"
            }
            
            if hours >= 12:
                hours %= 12
            
            if minutes == 0:
                print(f"{hours_dict2[hours]} часов ровно")
            elif minutes < 30:
                print(f"{minutes_dict[minutes]} {hours_dict1[(hours + 1) % 12]}")
            elif minutes == 30:
                print(f"{hours_dict1[(hours + 1) % 12]}")
            elif minutes < 45:
                print(f"{minutes_dict[minutes]} {hours_dict1[(hours + 1) % 12]}")
            else:
                print(f"Без {minutes_dict[minutes]} {hours_dict2[(hours + 1) % 12]}")